a=int(input())
"""

21. јануара до 19. фебруара
20. фебруара до 20. марта
21. марта до 20. априла
21. априла до 21. маја
22. маја до 21. јуна
22. јуна до 22. јула
23. јула до 22. августа
23. августа до 22. септембра
23. септембра до 23.октобра
24. октобра до 22. новембра
23. новембра до 21. децембра
22. децембра до 20. јануара
"""
l=[[0,1,21,19],[0,2,20,20],[0,3,21,20],[0,4,21,21],[0,5,22,21],[0,6,22,22],[0,7,23,22],[0,8,23,22],[0,9,23,23],[0,10,24,22],[0,11,23,21]]
for i in range(a):
    __=input()
    dan=int(a[0]+a[1])
    mesec=int(a[2]+a[3])
    if mesec==
    for j in range(len(l)):
        if mesec==l[j][1]:
            if 